# lab4
Отличия между сортировками, их плюсы и минусы

Начнем с пузырьковой сортировки, кратко опишем ее

Будем идти по массиву слева направо. Если текущий элемент больше следующего, меняем их местами. 
После первой итерации наибольшой элемент будет находиться в конце массива, на правильном месте. 
После двух итераций на правильном месте будут стоять два наибольших элемента, и так далее. 
Сложность в худшем и среднем случаях – O(n^2), в лучшем  – O(n).

Сортировка расчекой

Модификация сортировки пузырьком. 
Для того, чтобы избавиться от «черепах», будем переставлять элементы, стоящие на расстоянии. 
Зафиксируем его и будем идти слева направо, сравнивая элементы, стоящие на этом расстоянии, переставляя их, если необходимо. 
Когда расстояние станет равно единице, выполняется сортировка пузырьком. 
В лучшем случае сложность O(n*logn), в худшем – O(n^2). 

Сортировка пирамидой

Развитие идеи сортировки выбором. 
Воспользуемся структурой данных «пирамида». 
Она позволяет получать минимум за O(1), добавляя элементы и извлекая минимум за O(logn). 
Таким образом, сложность O(nlogn) в любом случае. 

Сортировка блоками

Пусть l – минимальный, а r – максимальный элемент массива. 
Разобьем элементы на блоки, в первом будут элементы от l до l + k, во втором – от l + k до l + 2k и т.д., где k = (r – l) / количество блоков.
Сложность и время работы зависит и от входных данных, и от количества блоков. 
